// Напишите программу, которая выдает число, обратное введенному
Console.WriteLine("Введите число: ");
var a = Console.ReadLine();
